app/controllers/users/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'amansingh@poplify.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
   def create
    if User.find_by_email(params[:user][:email]).present?